Ran Plan for 2 projects:

1. dir: `test-proj-2` workspace: `default`
1. dir: `test-proj-1` workspace: `default`

### 1. dir: `test-proj-2` workspace: `default`
**Plan Error**
```
running "/usr/local/bin/terraform plan -input=false -refresh -out \"/atlantis-data/repos/jskrill/terraform-atlantis-test/1/default/test-proj-2/default.tfplan\"" in "/atlantis-data/repos/jskrill/terraform-atlantis-test/1/default/test-proj-2": exit status 1
╷
│ Error: Required plugins are not installed
│ 
│ The installed provider plugins are not consistent with the packages
│ selected in the dependency lock file:
│   - registry.terraform.io/hashicorp/local: the cached package for registry.terraform.io/hashicorp/local 2.4.0 (in .terraform/providers) does not match any of the checksums recorded in the dependency lock file
│ 
│ Terraform uses external plugins to integrate with a variety of different
│ infrastructure services. You must install the required plugins before
│ running Terraform operations.
╵

```

---
### 2. dir: `test-proj-1` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.foo will be created
+ resource "local_file" "foo" {
      + content              = "file_content"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./foo.baz"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d test-proj-1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.skrillpc.stream/lock?id=jskrill%252Fterraform-atlantis-test%252Ftest-proj-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d test-proj-1`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`